//选作题
//输入一个字符串，形如
//3072x1728,2720x1536,2560x1600,2560x1440,2304x1728,2048x1536,1920x1200,1920x1080,1440x900,1280x800,1280x720,1024x768,1024x640,800x600,800x500,800x450,640x480,640x400,640x360,480x360,480x300,480x270,320x240,320x200,320x180,240x180,176x144,160x120,160x100,160x90
//这是一个显示器支持的分辨率清单，中间逗号分隔。
//现在输入画面的宽和高，然后在上述清单中挑选一个最接近的分辨率输出
//比如输入2000，1000，输出的分辨率应该是1920x1080，因为其它分辨率的误差更大。
//完成如下程序
#include<stdio.h>
#include<math.h>
int main(void){
    int n,i,j,k,m,count;
    int a[10000],b[10000];
	scanf("%d",&n);
	k=0;
	if(n%2==0&&n>=6){
	for(i=3;i<=n;i++){
		count=0;
		for(j=2;j<=i-1;j++){
			if(i%j==0){
				count=1;
				break;
			}	
		}
		if(count==0){
		
		a[k++]=i;}
	}
	for(m=0;m<=k-1;m++){
		if(a[m]>(n/2)){
		m--;
		break;}
	}
	for(i=0;i<=m;i++){
		b[i]=n-a[i];
		for(j=0;j<=k-1;j++){
			if(b[i]==a[j]){
			printf("%d %d\n",a[i],a[j]);
			
		    break;
			}
		}
	}
}
	else{
	printf("ERROR");}
	return 0;
} 

